<?php
// การสร้างฟังก์ชั่นแบบค่า default หรือค่าเริ่มต้น
// ตย.1
// ชื่อ นามสกุล ที่อยู่
function showData($Fname,$Lname,$city){
    print("ชื่อ = ".$Fname."<br>");
    print("นามสกุล = ".$Lname."<br>");
    print("ที่อยู่ = ".$city."<br>");
    print("<br>");
}
//การเรียกใช้งาน
showData("เรย์","วัฒน์","แม่สะเรียง");

//------------------------------------------------------

// ตย.2
function showData2($Fname,$Lname,$city="ยังไม่ได้เลือกที่อยู่"){ // พารามิเตอร์
    print("ชื่อ = ".$Fname."<br>");
    print("นามสกุล = ".$Lname."<br>");
    print("ที่อยู่ = ".$city."<br>");
    print("<br>");
}
showData2("เรย์","วัฒน์"); // ค่าเริ่มต้นจะถูกดึงมาใช้ในกรณีที่ไม่มีการกำหนดค่าเริ่มต้นในพารามิเตอร์
?>