<!-- ฟังก์ชั่นรับค่า -->
<?php
// การสร้างฟังก์ชั่น แบบ 1 ตัวแปร
 function show2($massage){ // massage => พารามิเตอร์ ตัวแปรรับ (รับค่าตัวแปรจาก show2 มาประมวนผลแล้วแสดงผลลัพธ์)
    print "ray".$massage;
    print "<br>";
    print "<hr>";
 }
 // เรียกฟังก์ชั่น
 show2("Wat"); // Wat => อากิวเมนต์ ตัวแปรส่ง (ส่งค่าไปเก็บไว้ในตัวแปร massage)

//-----------------------------------------------------------------------

// การสร้างฟังก์ชั่น แบบ มีมากกว่า 1 ตัวแปร
 function show3($number1,$number2,$number3){
   $result = $number1 + $number2 + $number3; // คำนวน
   print $number1."+".$number2."+".$number3."=".$result;
   print "<br>";
   print "<hr>";
}
// เรียกฟังก์ชั่น
show3(1,1,1); // ส่งค่าอากิวเมนต์แบบ ตัวเลข
$x = 2; // ประการตัวแปร X Y Z
$y = 2;
$z = 1;
show3($x,$y,$z); // ส่งค่าอากิวเมนต์แบบ ตัวแปร
?>