<?PHP
// ฟังก์ชั่นแบบส่งค่า

// เรียกใช้ตัวแปรเพื่อใช้ในการประมวลผลครั้งต่อไป
function getAddress(){
    return "แม่ฮ่องสอน";
}
$Address=getAddress(); // หาตัวแปรมารับค่า ในที่นี้จะใช้ Address มารับค่าเก็บไว้เพื่อนำไปใช้ในการประมวนผลต่อไป
print("ที่อยู่ของฉัน คือ = ".$Address."</br>"); // เรียกใช้งาน

//--------------------------------------------------------------------------------//

// เรียกใช้แบบมาแสดงแค่ครั้งเดียว
function getBonus(){
    return "999";
}
print("จำนวนโบนัส = ".getBonus()."</br>");// เรียกใช้งานฟังก์ชั่นแค่ครั้งเดียว

//--------------------------------------------------------------------------------//

// เรียกใช้ฟังก็ชั่น Function มาใช้ในการคำนวล
function getBonus2(){
    return 999;
}
$sumBonus=getBonus2(); //เรียกฟังก์ชั่นแล้วเก็บค่าไว้ใน $sumBonus
$salary = 1; // ประตัวแปร salary เพื่อเก็บค่าเงินเดือน
$sum = $salary+$sumBonus; // นำค่า salary และ sunBonus มาบวกกันแล้วเก็บค่าไว้ในตัวแปร sum
print("เงินเดือน\t".$salary."\t+\t".$sumBonus."\t=\t".$sum);

//--------------------------------------------------------------------------------//

// return ค่าแปรตัวแปร
function getAllSum(){
    $x = 10;
    print "</br>";
    return $x; // return ค่าตัวแปร x    
}
print (getAllSum());

?>