<?php
// เป็นการนำส่วนห้องอีกไฟล์หนึ่งเข้ามาทำงานอีกไฟล์หนึ่ง
// ใช้ในกรณีที่เราไม่ต้องการเขียนไฟล์หลายไฟล์ให้รวมอยู่ไฟล์เดียว
include "menu.php" // เรียกไฟล์ menu.php 
?>
<!--  -------------------------------------------------------------------- -->
<?php
address(); // ตย. เรียกใช้ฟังก์ชั่นตัวแปรใน menu มาใช้งาน
?>
<!--  -------------------------------------------------------------------- -->
</br>
<!--  -------------------------------------------------------------------- -->
<?php
address2("แม่ฮ่องสอน"); // ตย. เรียกใช้ฟังก์ชั่นตัวแปรใน menu มาใช้งาน
?>
<!--  -------------------------------------------------------------------- -->
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>
    <?php
    echo "<h2>RayWat chanel...</h2>";
    ?>   
</body>
</html>
<!--  -------------------------------------------------------------------- -->
<?php
include "menuFooter.php"; // เรียกไฟล์ menuFooter.php
?>
<!--  -------------------------------------------------------------------- -->
<!-- คำสั่งที่ใช้ดึกไฟล์จากอีกไฟล์นำมาใช้งาน -->
<!-- include ใช้เรียกข้อมูลที่ไม่ค่อยสำคัญ ในการตึงข้อมูลหรือหาไฟล์ไม่พบ ให้ข้ามไปทำในส่วยอื่นๆต่อ -->
<!-- include_once การทำงานเหมือน include แต่จำทำงานเพียงแค่ครั้งเดียว -->
<!-- require ใช้ในกรณีที่สำคัญ หากหาไฟล์ไม่พบโปรแกรมจะหยุดทำงานทั้งหมด -->