<?php
// ตัวอย่างการใช้แบบตัวเลข
$year = 7;
switch ($year) {
    case '5':
        echo "ระยะเวลากู้ ".$year." ปี"." คิดดอกเบี้ย 10%";
        break;
    case '6':    
        echo "ระยะเวลากู้ ".$year." ปี"." คิดดอกเบี้ย 20%";
        break;
    default:
        echo "ระยะเวลาในการกู้ไม่เป็นไปตามที่กำหนด";
        break;
}

echo "<hr>";
// ตย.การใช้แบบตัวหนังสือ
$year = "ระยะเวลาที่ 1";
switch ($year) {
    case 'ระยะเวลาที่ 1':
        echo $year." ถูกปรับเงินเดือนขึ้น 5%";
        break;
    case 'ระยะเวลาที่ 2':
        echo $year." ถูกปรับเงินเดือนขึ้น 10%";
        break;       
    default:
        echo "คุณามบัติยังไม่ป่านเกณฑ์";
        break;
}
?>